In [97]:
import datetime
import ipywidgets as widgets
import mysql.connector as mysql
import pandas as pd

### let's connect to the database

In [240]:
con = mysql.connect(user = "db_2019", password = "db_2019db_2019db_2019", 
                    host = "localhost", database = "discourse_management")
cur = con.cursor(dictionary=True)

## SIMPLE SQL-python interface functions

### Utils

In [178]:
def protect(names):
    """
    protects values with `` on both sides
    
    :param names: list of str or str
    :return: list of stror str with `` around each str
    """
    if type(names) == str:
        return f"`{names}`"
    elif type(names) == list or tuple:
        return [f"`{value}`" for value in names]

In [246]:
protect('WHY')

'`WHY`'

In [245]:
protect(['I', 'do', 'hate', 'programming!'])

['`I`', '`do`', '`hate`', '`programming!`']

In [193]:
def str_values(values):
    """
    protects values for SQL (adds '' around strings, str other types)
    
    :param values: list
    :return: list of protected values separated by commas
    """
    return [f"'{value}'" if type(value) == str or datetime.date else str(value) for value in values]

In [250]:
str_values(['I', 'was', 'born on', datetime.date(1999, 12, 30), 'not on the', 1, 'st', 'of January'])

["'I'",
 "'was'",
 "'born on'",
 "'1999-12-30'",
 "'not on the'",
 "'1'",
 "'st'",
 "'of January'"]

### INSERT

In [192]:
def insert(data, table_name, column_names_dict):
    """
    inserts data into a database table
    
    date should be passed in format YYYY-MM-DD
    
    :param data: list of lists of data
    :param table_name: str, table name
    :param column_names_dict: dict, keys - column names, values - int, ids inside data inner lists
    """
    columns, ids = list(zip(*list(column_names_dict.items())))
    columns = protect(columns)
    for line in data:
        req = f"INSERT INTO {protect(table_name)} ({', '.join(columns)}) VALUES "
        values = str_values([line[i] for i in ids])
        req += f"({', '.join(values)})"
        try:
            cur.execute(req)
            con.commit()
        except Exception as e:
            print(e)
            print(req)

In [194]:
data = [[1, 'no', 'oh', str(datetime.date(2019, 12, 24))], 
        [4, '!!!', 'hurray', str(datetime.date(2000, 1, 1))]]
column_names_dict = {'int_col':0, 'str_col':2, 'str_col2':1, 'date_col':3}
insert(data, 'example', column_names_dict)

**IT DID THE INSERT!!!**
You will see it below, when we select stuff from the table :)

### SELECT

In [136]:
def select(table_names, column_names='*', condition=None, distinct=False):
    """
    selects data from database tables on condition
    
    :param table_name: list of str, table names
    :param column_names: list of str, column names, optional, default '*'
    :param condition: str, condition on column names and values, optional, default None
    :param distinct: bool, whether to drop identical values, optional, default False
    """
    table_names_str = ', '.join(protect(table_names))
    if type(column_names) == list:
        column_names_str = ', '.join(protect(column_names))
    else:
        column_names_str = column_names
        
    if distinct:
        distinct = "distinct"
    else:
        distinct = ""
    
    req = f"SELECT {distinct} {column_names_str} FROM {table_names_str}"
    if condition:
        req += f"WHERE {condition}"
    try:
        cur.execute(req)
        res = cur.fetchall()
        if res:
            return pd.DataFrame.from_records(res)
        else:
            print('Nothing was found for your request!')
    except Exception as e:
        print(e)
        print(req)

In [195]:
select(['example'])

   id_example  int_col str_col str_col2    date_col
0           1        1    hell       no  2001-01-01
1           2        1      oh       no  2019-12-24
2           3        0  please       no  2000-01-01
3           4        3      oh      yay  2019-12-24
4           5        4  hurray      !!!  2000-01-01
5           6        1      oh       no  2019-12-24
6           7        4  hurray      !!!  2000-01-01

In [196]:
select(['example'], condition='id_example < 3')

   id_example  int_col str_col str_col2    date_col
0           1        1    hell       no  2001-01-01
1           2        1      oh       no  2019-12-24

In [197]:
select(['example'], ['int_col', 'str_col2'], condition='id_example < 4')

   int_col str_col2
0        1       no
1        1       no
2        0       no

In [198]:
select(['example'], ['int_col', 'str_col2'], condition='id_example < 4', distinct=True)

   int_col str_col2
0        1       no
1        0       no

**OMG THIS ALSO WORKED**

In [199]:
select(['subjects', 'experiments', 'staff'], ['id_experiment', 'staff_surname', 'collection_date'], condition='subjects.id_subject = experiments.id_subject and experiments.id_staff_collected = staff.id_staff')

   id_experiment staff_surname collection_date
0              1     Рязанская      2019-01-20
1              2      Худякова      2019-03-18
2              3     Рязанская      2018-01-10
3              4      Худякова      2017-09-11
4              5     Рязанская      2019-05-22
5              6      Худякова      2017-11-23

In [200]:
select(['subjects', 'experiments', 'staff'], ['id_experiment', 'staff_surname', 'collection_date'], condition='subjects.id_subject = experiments.id_subject and experiments.id_staff_collected > 2')

Nothing was found for your request!

**IT WORKS WITH REAL DATA TOO!**

### UPDATE

In [215]:
def update(table_name, column_names, values, condition):
    """
    changes one entry in a database table
    
    :param table_name: str, table name
    :param column_names: list of str, column names, 
    :param values: list, data to be changed
    :param condition: str of type "`id_example` = '1'"
    """
    if len(column_names) != len(values):
        print(f"expected column_names and values of the same length, got {len(column_names)} and {len(values)}")
        return
    table_name = protect(table_name)
    column_names = protect(column_names)
    values = str_values(values)
    changes = [f"{column_names[i]} = {values[i]}" for i in range(len(column_names))]
    req = f"UPDATE {table_name} SET {', '.join(changes)} WHERE ({condition})"
    try:
        cur.execute(req)
        con.commit()
    except Exception as e:
        print(e)
        print(req)

In [211]:
select(['example'], condition='id_example = 1')

   id_example  int_col str_col str_col2    date_col
0           1        1    hell       no  2001-01-01

In [261]:
update('example', ['int_col', 'str_col2'], [32, 'yes'], "id_example = 1")

In [262]:
select(['example'], condition='id_example = 1')

   id_example  int_col  str_col str_col2    date_col
0           1       32  forever      yes  2001-01-01

**OK, NICE, UPDATING WORKS**

In [221]:
def update_multiple(data, table_name, id_col_name, ids):
    """
    changes multiple entries in a database table (one by one)
    
    :param data: list of tuples (column_names - list of str and values - list of the same length)
    :param table_name: str, table name
    :param id_col_name: str, name of the primary key column in the table
    :param ids: list of int, ids in the primary key column of the values to be changed
    """
    if len(data) != len(ids):
        print(f"expected data and ids of the same length, got {len(data)} and {len(ids)}")
        return
    for i, line in enumerate(data):
        column_names, values = line
        update(table_name, column_names, values, f"{protect(id_col_name)} = '{ids[i]}'")

In [256]:
select(['example'], condition='id_example = 1 or id_example = 3')

   id_example  int_col  str_col str_col2    date_col
0           1      666  forever     hell  2001-01-01
1           3        0   please       no  2000-01-01

In [257]:
data = [(['int_col', 'str_col2', 'str_col'], [666, 'hell', 'forever']),
       (['date_col'], [datetime.date.today()])]
ids = [1, 3]
update_multiple(data, 'example', 'id_example', ids)

In [259]:
select(['example'], condition='id_example = 1 or id_example = 3')

   id_example  int_col  str_col str_col2    date_col
0           1      666  forever     hell  2001-01-01
1           3        0   please       no  2019-12-24

**NOW I CAN UPDATE MULTIPLE ROWS AT ONCE**

### DELETE

In [239]:
"DELETE FROM `discourse_management`.`subjects` WHERE (`id_subject` = '49')"
def delete(table_name, id_col_name, ids):
    """
    deletes entries in a database table (one by one)
    
    :param table_name: str, table name
    :param id_col_name: str, name of the primary key column in the table
    :param ids: list of int, ids in the primary key column of the entries to be deleted
    """
    for i in ids:
        req = f"DELETE FROM {protect(table_name)} WHERE ({protect(id_col_name)} = '{i}')"
        try:
            cur.execute(req)
            con.commit()
        except Exception as e:
            print(e)
            print(req)

In [251]:
select(['example'])

   id_example  int_col  str_col str_col2    date_col
0           1      666  forever      yes  2001-01-01
1           2        1       oh       no  2019-12-24
2           3        0   please       no  2000-01-01
3           5        4   hurray      !!!  2000-01-01
4           7        4   hurray      !!!  2000-01-01

In [252]:
delete('example', 'id_example', [5, 7])

In [253]:
select(['example'])

   id_example  int_col  str_col str_col2    date_col
0           1      666  forever      yes  2001-01-01
1           2        1       oh       no  2019-12-24
2           3        0   please       no  2000-01-01

**NOW I HAVE MOST OF WHAT I MIGHT NEED, RIGHT?**

### let us try to work with real CSV data

In [228]:
with open ('data\personal_aphasia.csv', 'r', encoding='utf-8-sig') as f:
    lines = f.readlines()

lines = [line.strip().split(';') for line in lines]
header = [x for x in lines[0] if x]
lines = [line[:len(header)] for line in lines[1:]]
print(header)
lines = [[line[0]]+[line[1].lower()]+line[2:] for line in lines]
print(lines[1])
print(lines[15])

['ID', 'Sex', 'Age', 'Education', 'Aphasia type', 'Severity', 'Time post-onset', 'Etiology', 'Lesion location', 'Type']
['P12', 'f', '47', 'higher (unfinished)', 'dynamic, complex motor', 'moderate', '2 y, 3 m', 'CVA', 'lMCA', 'aphasia']
['P6', 'm', '49', 'higher', '', '', '', '', '', 'norm']

In [241]:
select(['subjects'])

,id_subject,id_personal_info,language,language_comment,sex,handedness_type
0,25,DUMMY1,russian-mono,None,f,right
1,26,DUMMY2,russian-mono,None,m,left
2,27,DUMMY3,russian-bi,georgian,f,right
3,28,DUMMY4,russian-mono,None,m,right

In [242]:
data = [lines[1][:2]+['russian-mono']]
column_names_dict = {'id_personal_info':0, 'sex':1, 'language':2}
insert(data, 'subjects', column_names_dict)

In [243]:
select(['subjects'])

,id_subject,id_personal_info,language,language_comment,sex,handedness_type
0,25,DUMMY1,russian-mono,None,f,right
1,26,DUMMY2,russian-mono,None,m,left
2,27,DUMMY3,russian-bi,georgian,f,right
3,28,DUMMY4,russian-mono,None,m,right
4,50,P12,russian-mono,None,f,None

## ok, here's how widgets work

In [5]:
!jupyter nbextension enable --py widgetsnbextension

Enabling notebook extension jupyter-js-widgets/extension...
      - Validating: ok

In [35]:
style = {'description_width': 'initial'}

In [52]:
check = widgets.Checkbox(
        value=False,
        description='Check me',
        disabled=False)

dont = widgets.Checkbox(
        value=False,
        description='Do not check me',
        disabled=False)

ui = widgets.VBox([check, dont])

out = widgets.interactive_output(lambda a,b: print(a, b), {'a': check, 'b': dont})

display(ui)
out

VBox(children=(Checkbox(value=False, description='Check me'), Checkbox(value=False, description='Do not check …

Output()

In [37]:
options = ['Apples', 'Oranges', 'Pears']
widgets.interact(lambda x: print(x), x=widgets.SelectMultiple(
        options=options,
        value=['Oranges'],
        rows=len(options),
        description='Fruits: ',
        disabled=False));

interactive(children=(SelectMultiple(description='Fruits: ', index=(1,), options=('Apples', 'Oranges', 'Pears'…

In [36]:
widgets.interact(lambda x: print(x), x=widgets.RadioButtons(
        options=['pepperoni', 'pineapple', 'anchovies'],
        value='pineapple',
        description='Pizza topping:',
        disabled=False,
        style=style
    ));

interactive(children=(RadioButtons(description='Pizza topping:', index=1, options=('pepperoni', 'pineapple', '…

In [32]:
widgets.interact(lambda x: print(x), x=widgets.Dropdown(
        options=[('One', 1), ('Two', 2), ('Three', 3)],
        value=2,
        description='Number:',
    ));

interactive(children=(Dropdown(description='Number:', index=1, options=(('One', 1), ('Two', 2), ('Three', 3)),…